``` sql
Q. Write an SQL query to display the below output.

Table Script:

create table input(
    id int,
    val1 varchar(50),
    val2 varchar(50),
    val3 varchar(50)
    );

insert into input values(1,null,null,'hello');
insert into input values(1,'world',null,null);
insert into input values(2,'good','morning','spark');
insert into input values(1,null,'spark',null);

Output:

1, world, spark, hello

2, good, morning, spark

``` sql

select * from input;

+------+-------+---------+-------+
| id   | val1  | val2    | val3  |
+------+-------+---------+-------+
|    1 | NULL  | NULL    | hello |
|    1 | world | NULL    | NULL  |
|    2 | good  | morning | spark |
|    1 | NULL  | spark   | NULL  |
+------+-------+---------+-------+
```
### Q. Write an SQL query to display the below output.

``` sql
+------+-------+---------+-------+
| id   | val1  | val2    | val3  |
+------+-------+---------+-------+
|    1 | world | spark   | hello |
|    2 | good  | morning | spark |
+------+-------+---------+-------+
```

**Solution:**
``` sql

select id, max(val1) as val1, max(val2) as val2, max(val3) as val3
from input
group by id
order by id;